IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/STM0_CTI_CSCTI.xml
<module name="STM0_CTI_CSCTI" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CTI__CFG__CSCTI_CFG_CTICONTROL" acronym="CTI__CFG__CSCTI_CFG_CTICONTROL" offset="0x0" width="32" description=" The CTI Control Register enables the CTI.  >">
		<bitfield id="GLBEN" width="1" begin="0" end="0" resetval="0x0" description=" Enables or disables the ECT. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINTACK" acronym="CTI__CFG__CSCTI_CFG_CTIINTACK" offset="0x10" width="32" description=" The CTI Interrupt Acknowledge Register is write-only. Any bits written as a 1 cause the ctitrigout output signal to be acknowledged. The acknowledgement is cleared when MAPTRIGOUT is deactivated. This register is used when the ctitrigout is used as a sticky output, that is, no hardware acknowledge is supplied, and a software acknowledge is required. ">
		<bitfield id="INTACK" width="8" begin="7" end="0" resetval="0x0" description=" Acknowledges the corresponding ctitrigout output. There is one bit of the register for each ctitrigout output.   When a 1 is written to a bit in this register, the corresponding ctitrigout is acknowledged and is cleared when MAPTRIGOUT is LOW. Writing a 0 to any of the bits in this register has no effect. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIAPPSET" acronym="CTI__CFG__CSCTI_CFG_CTIAPPSET" offset="0x14" width="32" description=" The CTI Application Trigger Set Register is read/write. A write to this register causes a channel event to be raised, corresponding to the bit written to. ">
		<bitfield id="APPSET" width="4" begin="3" end="0" resetval="0x0" description=" Setting a bit HIGH generates a channel event for the selected channel. There is one bit of the register for each channel.   Read : 0 = application trigger inactive (reset). 1 = application trigger active.  Write : 0 = no effect. 1 = generate channel event. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIAPPCLEAR" acronym="CTI__CFG__CSCTI_CFG_CTIAPPCLEAR" offset="0x18" width="32" description=" The CTI Interrupt Acknowledge Register is write-only. A write to this register causes a channel event to be cleared, corresponding to the bit written to. ">
		<bitfield id="APPCLEAR" width="4" begin="3" end="0" resetval="0x0" description=" Clears corresponding bits in the CTIAPPSET register. There is one bit of the register for each channel.   When a 1 is written to a bit in this register, the corresponding application trigger is disabled in the CTIAPPSET register. Writing a 0 to any of the bits in this register has no effect. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIAPPPULSE" acronym="CTI__CFG__CSCTI_CFG_CTIAPPPULSE" offset="0x1C" width="32" description=" The CTI Application Pulse Register is write-only. A write to this register causes a channel event pulse, one cticlk period, to be generated, corresponding to the bit written to. The pulse external to the ECT can be extended to multi-cycle by the handshaking interface circuits. This register clears itself immediately, so it can be repeatedly written to without software having to clear it. ">
		<bitfield id="APPULSE" width="4" begin="3" end="0" resetval="0x0" description=" Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.   When a 1 is written to a bit in this register, a corresponding channel event pulse is generated for one cticlk period. Writing a 0 to any of the bits in this register has no effect. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN0" acronym="CTI__CFG__CSCTI_CFG_CTIINEN0" offset="0x20" width="32" description=" The CTI Trigger 0 to Channel Enable Register enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN1" acronym="CTI__CFG__CSCTI_CFG_CTIINEN1" offset="0x24" width="32" description=" The CTI Trigger 1 to Channel Enable Register enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN2" acronym="CTI__CFG__CSCTI_CFG_CTIINEN2" offset="0x28" width="32" description=" The CTI Trigger to Channel Enable Register 0 enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN3" acronym="CTI__CFG__CSCTI_CFG_CTIINEN3" offset="0x2C" width="32" description=" The CTI Trigger to Channel Enable Register 0 enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN4" acronym="CTI__CFG__CSCTI_CFG_CTIINEN4" offset="0x30" width="32" description=" The CTI Trigger to Channel Enable Register 0 enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN5" acronym="CTI__CFG__CSCTI_CFG_CTIINEN5" offset="0x34" width="32" description=" The CTI Trigger to Channel Enable Register 0 enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN6" acronym="CTI__CFG__CSCTI_CFG_CTIINEN6" offset="0x38" width="32" description=" The CTI Trigger to Channel Enable Register 0 enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
