IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/STM0_CTI_CSCTI.xml
	<register id="CTI__CFG__CSCTI_CFG_CTIINEN7" acronym="CTI__CFG__CSCTI_CFG_CTIINEN7" offset="0x3C" width="32" description=" The CTI Trigger to Channel Enable Register 0 enables the signalling of an event on CTM channels when the core issues a trigger, ctitrigin, to the CTI. Within this register there is one bit for each of the four channels implemented. This register does not affect the application trigger operations. ">
		<bitfield id="TRIGINEN" width="4" begin="3" end="0" resetval="0x0" description=" Enables a cross trigger event to the corresponding channel when an ctitrigin is activated. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, it enables the ctitrigin signal to generate an event on the respective channel of the CTM. For example, TRIGINEN[0] set to 1 enables ctitrigin onto channel 0. Writing a 0 to any of the bits in this register disables the ctitrigin signal from generating an event on the respective channel of the CTM.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN0" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN0" offset="0xA0" width="32" description=" The CTI Channel to Trigger 0 Enable Registers define which channels can generate a ctitrigout[0] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[1] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[0] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN1" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN1" offset="0xA4" width="32" description=" The CTI Channel to Trigger 1 Enable Registers define which channels can generate a ctitrigout[1] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[1] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[1] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN2" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN2" offset="0xA8" width="32" description=" The CTI Channel to Trigger 2 Enable Registers define which channels can generate a ctitrigout[2] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[2] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[2] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN3" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN3" offset="0xAC" width="32" description=" The CTI Channel to Trigger 3 Enable Registers define which channels can generate a ctitrigout[3] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[3] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[3] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN4" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN4" offset="0xB0" width="32" description=" The CTI Channel to Trigger 4 Enable Registers define which channels can generate a ctitrigout[4] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[4] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[4] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN5" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN5" offset="0xB4" width="32" description=" The CTI Channel to Trigger 5 Enable Registers define which channels can generate a ctitrigout[5] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[5] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[5] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN6" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN6" offset="0xB8" width="32" description=" The CTI Channel to Trigger 6 Enable Registers define which channels can generate a ctitrigout[6] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[6] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[6] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIOUTEN7" acronym="CTI__CFG__CSCTI_CFG_CTIOUTEN7" offset="0xBC" width="32" description=" The CTI Channel to Trigger 7 Enable Registers define which channels can generate a ctitrigout[7] output. Within this register there is one bit for each of the four channels implemented. This register affects the mapping from application trigger to trigger outputs. ">
		<bitfield id="TRIGOUTEN" width="4" begin="3" end="0" resetval="0x0" description=" Changing the value of this bit from a 0 to a 1 enables a channel event for the corresponding channel to generate a ctitrigout[7] output. There is one bit of the field for each of the four channels.   When a 1 is written to a bit in this register, the channel input (ctichin) from the CTM is routed to the ctitrigout output. For example, enabling bit 0 enables ctichin[0] to cause a trigger event on the ctitrigout[7] output. When a 0 is written to any of the bits in this register, the channel input (ctichin) from the CTM is not routed to the ctitrigout output.  Reading this register returns the programmed value. " range="3 - 0" rwaccess="R/W"/>
	</register>
