IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/STM0_CTI_CSCTI.xml
	<register id="CTI__CFG__CSCTI_CFG_CTITRIGINSTATUS" acronym="CTI__CFG__CSCTI_CFG_CTITRIGINSTATUS" offset="0x130" width="32" description=" The CTI Trigger In Status Register provides the status of the ctitrigin inputs. ">
		<bitfield id="TRIGINSTATUS" width="8" begin="7" end="0" resetval="0x0" description=" Shows the status of the ctitrigin inputs.   1 = ctitrigin is active. 0 = ctitrigin is inactive.  Because the register provides a view of the raw ctitrigin inputs, the reset value is unknown. There is one bit of the field for each trigger input. " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTITRIGOUTSTATUS" acronym="CTI__CFG__CSCTI_CFG_CTITRIGOUTSTATUS" offset="0x134" width="32" description=" The CTI Trigger Out Status Register provides the status of the ctitrigout outputs. ">
		<bitfield id="TRIGOUTSTATUS" width="8" begin="7" end="0" resetval="0x0" description=" Shows the status of the ctitrigout outputs.   1 = ctitrigout is active. 0 = ctitrigout is inactive.  There is one bit of the field for each trigger output. " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTICHINSTATUS" acronym="CTI__CFG__CSCTI_CFG_CTICHINSTATUS" offset="0x138" width="32" description=" The CTI Channel In Status Register provides the status of the ctichin inputs. ">
		<bitfield id="CTICHINSTATUS" width="4" begin="3" end="0" resetval="0x0" description=" Shows the status of the ctichin inputs.   1 = ctichin is active. 0 = ctichin is inactive.  Because the register provides a view of the raw ctichin inputs, the reset value is unknown. There is one bit of the field for each channel input. " range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTICHOUTSTATUS" acronym="CTI__CFG__CSCTI_CFG_CTICHOUTSTATUS" offset="0x13C" width="32" description=" The CTI Channel Out Status Register provides the status of the CTI ctichout outputs. ">
		<bitfield id="CTICHOUTSTATUS" width="4" begin="3" end="0" resetval="0x0" description=" Shows the status of the ctichout outputs.   1 = ctichout is active. 0 = ctichout is inactive.  There is one bit of the field for each channel output. " range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CTIGATE" acronym="CTI__CFG__CSCTI_CFG_CTIGATE" offset="0x140" width="32" description=" The Gate Enable Register prevents the channels from propagating through the CTM to other CTIs. This enables local cross-triggering, for example for causing an interrupt when the ETM trigger occurs. It can be used effectively with CTIAPPSET, CTIAPPCLEAR, and CTIAPPPULSE for asserting trigger outputs by asserting channels, without affecting the rest of the system. On reset, this register is 0xF, and channel propagation is enabled. ">
		<bitfield id="CTIGATEEN3" width="1" begin="3" end="3" resetval="0x1" description=" Enable CTICHOUT3. Set to 0 to disable channel propagation. " range="3" rwaccess="R/W"/> 
		<bitfield id="CTIGATEEN2" width="1" begin="2" end="2" resetval="0x1" description=" Enable CTICHOUT2. Set to 0 to disable channel propagation. " range="2" rwaccess="R/W"/> 
		<bitfield id="CTIGATEEN1" width="1" begin="1" end="1" resetval="0x1" description=" Enable CTICHOUT1. Set to 0 to disable channel propagation. " range="1" rwaccess="R/W"/> 
		<bitfield id="CTIGATEEN0" width="1" begin="0" end="0" resetval="0x1" description=" Enable CTICHOUT0. Set to 0 to disable channel propagation. " range="0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ASICCTL" acronym="CTI__CFG__CSCTI_CFG_ASICCTL" offset="0x144" width="32" description=" Implementation-defined ASIC control, value written to the register is output on asicctl[7 : 0]. ">
		<bitfield id="ASICCTL" width="8" begin="7" end="0" resetval="0x0" description=" Implementation-defined ASIC control, value written to the register is output on asicctl[7 : 0].   If external multiplexing of trigger signals is implemented then the number of multiplexed signals on each trigger must be reflected within the Device ID Register. This is done within a Verilog define EXTMUXNUM. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITCHINACK" acronym="CTI__CFG__CSCTI_CFG_ITCHINACK" offset="0xEDC" width="32" description=" This register is a write-only register. It can be used to set the value of the CTCHINACK outputs. ">
		<bitfield id="CTCHINACK" width="4" begin="3" end="0" resetval="0x0" description=" Set the value of the CTCHINACK outputs. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITTRIGINACK" acronym="CTI__CFG__CSCTI_CFG_ITTRIGINACK" offset="0xEE0" width="32" description=" This register is a write-only register. It can be used to set the value of the CTTRIGINACK outputs. ">
		<bitfield id="CTTRIGINACK" width="8" begin="7" end="0" resetval="0x0" description=" Set the value of the CTTRIGINACK outputs. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITCHOUT" acronym="CTI__CFG__CSCTI_CFG_ITCHOUT" offset="0xEE4" width="32" description=" This register is a write-only register. It can be used to set the value of the CTCHOUT outputs. ">
		<bitfield id="CTCHOUT" width="4" begin="3" end="0" resetval="0x0" description=" Set the value of the CTCHOUT outputs. " range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITTRIGOUT" acronym="CTI__CFG__CSCTI_CFG_ITTRIGOUT" offset="0xEE8" width="32" description=" This register is a write-only register. It can be used to set the value of the CTTRIGOUT outputs. ">
		<bitfield id="CTTRIGOUT" width="8" begin="7" end="0" resetval="0x0" description=" Set the value of the CTTRIGOUT outputs. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITCHOUTACK" acronym="CTI__CFG__CSCTI_CFG_ITCHOUTACK" offset="0xEEC" width="32" description=" This register is a read-only register. It can be used to read the values of the CTCHOUTACK inputs. ">
		<bitfield id="CTCHOUTACK" width="4" begin="3" end="0" resetval="0x0" description=" Read the values of the CTCHOUTACK inputs. " range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITTRIGOUTACK" acronym="CTI__CFG__CSCTI_CFG_ITTRIGOUTACK" offset="0xEF0" width="32" description=" This register is a read-only register. It can be used to read the values of the CTTRIGOUTACK inputs. ">
		<bitfield id="CTTRIGOUTACK" width="8" begin="7" end="0" resetval="0x0" description=" Read the value of the CTTRIGOUTACK inputs. " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITCHIN" acronym="CTI__CFG__CSCTI_CFG_ITCHIN" offset="0xEF4" width="32" description=" This register is a read-only register. It can be used to read the values of the CTCHIN inputs. ">
		<bitfield id="CTCHIN" width="4" begin="3" end="0" resetval="0x0" description=" Read the value of the CTCHIN inputs. " range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITTRIGIN" acronym="CTI__CFG__CSCTI_CFG_ITTRIGIN" offset="0xEF8" width="32" description=" This register is a read-only register. It can be used to read the values of the CTTRIGIN inputs. ">
		<bitfield id="CTTRIGIN" width="8" begin="7" end="0" resetval="0x0" description=" Read the values of the CTTRIGIN inputs. " range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_ITCTRL" acronym="CTI__CFG__CSCTI_CFG_ITCTRL" offset="0xF00" width="32" description=" This register is used to enable topology detection. For more information see the CoreSight Architecture Specification. This register enables the component to switch from a functional mode, the default behavior, to integration mode where the inputs and outputs of the component can be directly controlled for the purpose of integration testing and topology solving.   Note : When a device has been in integration mode, it might not function with the original behavior. After performing integration or topology detection, you must reset the system to ensure correct behavior of CoreSight and other connected system components that are affected by the integration or topology detection. ">
		<bitfield id="INTEGRATION_MODE" width="1" begin="0" end="0" resetval="0x0" description=" Allows the component to switch from functional mode to integration mode or back." range="0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CLAIMSET" acronym="CTI__CFG__CSCTI_CFG_CLAIMSET" offset="0xFA0" width="32" description=" This is used in conjunction with Claim Tag Clear Register, CLAIMCLR. This register forms one half of the Claim Tag value. This location allows individual bits to be set, write, and returns the number of bits that can be set, read.">
		<bitfield id="CLAIMSET" width="4" begin="3" end="0" resetval="0x0" description=" This claim tag bit is implemented" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_CLAIMCLR" acronym="CTI__CFG__CSCTI_CFG_CLAIMCLR" offset="0xFA4" width="32" description=" This register is used in conjunction with Claim Tag Set Register, CLAIMSET. This register forms one half of the Claim Tag value. This location enables individual bits to be cleared, write, and returns the current Claim Tag value, read.">
		<bitfield id="CLAIMCLR" width="4" begin="3" end="0" resetval="0x0" description=" The value present reflects the current setting of the Claim Tag." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_LAR" acronym="CTI__CFG__CSCTI_CFG_LAR" offset="0xFB0" width="32" description=" This is used to enable write access to device registers.   External accesses from a debugger (paddrdbg31 = 1) are not subject to the Lock Registers. A debugger does not have to unlock the component in order to write and modify the registers in the component. ">
		<bitfield id="ACCESS_W" width="32" begin="31" end="0" resetval="0x0" description=" A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than 0xC5ACCE55 will have the affect of removing write access." range="31 - 0" rwaccess="R/W"/>
	</register>
