IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/STM0_CTI_CSCTI.xml
	<register id="CTI__CFG__CSCTI_CFG_LSR" acronym="CTI__CFG__CSCTI_CFG_LSR" offset="0xFB4" width="32" description=" This indicates the status of the Lock control mechanism. This lock prevents accidental writes by code under debug. When locked, write access is blocked to all registers, except the Lock Access Register.   External accesses from a debugger (paddrdbg31 = 1) are not subject to the Lock Registers. This register reads as 0 when read from an external debugger (paddrdbg31 = 1). ">
		<bitfield id="LOCKTYPE" width="1" begin="2" end="2" resetval="0x0" description=" Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit" range="2" rwaccess="R"/> 
		<bitfield id="LOCKGRANT" width="1" begin="1" end="1" resetval="0x1" description=" Returns the current status of the Lock. This bit reads as 0 when read from an external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers." range="1" rwaccess="R"/> 
		<bitfield id="LOCKEXIST" width="1" begin="0" end="0" resetval="0x1" description=" Indicates that a lock control mechanism exists for this device. This bit reads as 0 when read from an external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers." range="0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_AUTHSTATUS" acronym="CTI__CFG__CSCTI_CFG_AUTHSTATUS" offset="0xFB8" width="32" description=" Reports what functionality is currently permitted by the authentication interface.">
		<bitfield id="SNID" width="2" begin="7" end="6" resetval="0x0" description=" Indicates the security level for secure non-invasive debug" range="7 - 6" rwaccess="R"/> 
		<bitfield id="SID" width="2" begin="5" end="4" resetval="0x0" description=" Indicates the security level for secure invasive debug" range="5 - 4" rwaccess="R"/> 
		<bitfield id="NSNID" width="2" begin="3" end="2" resetval="0x2" description=" Indicates the security level for non-secure non-invasive debug" range="3 - 2" rwaccess="R"/> 
		<bitfield id="NSID" width="2" begin="1" end="0" resetval="0x2" description=" Indicates the security level for non-secure invasive debug" range="1 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_DEVID" acronym="CTI__CFG__CSCTI_CFG_DEVID" offset="0xFC8" width="32" description=" This register indicates the capabilities of the CTI.">
		<bitfield id="NUMCH" width="4" begin="19" end="16" resetval="0x4" description=" Number of ECT channels available." range="19 - 16" rwaccess="R"/> 
		<bitfield id="NUMTRIG" width="8" begin="15" end="8" resetval="0x8" description=" Number of ECT triggers available." range="15 - 8" rwaccess="R"/> 
		<bitfield id="EXTMUXNUM" width="5" begin="4" end="0" resetval="0x0" description=" Indicates the number of multiplexing available on Trigger Inputs and Trigger Outputs using asicctl. Default value of 5'b00000 indicating no multiplexing present. Reflects the value of the Verilog define EXTMUXNUM that the user must alter accordingly." range="4 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_DEVTYPE" acronym="CTI__CFG__CSCTI_CFG_DEVTYPE" offset="0xFCC" width="32" description=" It provides a debugger with information about the component when the Part Number field is not recognized. The debugger can then report this information.">
		<bitfield id="SUB_TYPE" width="4" begin="7" end="4" resetval="0x1" description=" Sub-classification within the major category" range="7 - 4" rwaccess="R"/> 
		<bitfield id="MAJOR_TYPE" width="4" begin="3" end="0" resetval="0x4" description=" Major classification grouping for this debug/trace component" range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_PERIPHID4" acronym="CTI__CFG__CSCTI_CFG_PERIPHID4" offset="0xFD0" width="32" description=" Part of the set of Peripheral Identification registers. Contains part of the designer identity and the memory footprint indicator.">
		<bitfield id="SIZE" width="4" begin="7" end="4" resetval="0x0" description=" This is a 4-bit value that indicates the total contiguous size of the memory window used by this component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then this should read as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on." range="7 - 4" rwaccess="R"/> 
		<bitfield id="DES_2" width="4" begin="3" end="0" resetval="0x4" description=" JEDEC continuation code indicating the designer of the component (along with the identity code)" range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_PERIPHID0" acronym="CTI__CFG__CSCTI_CFG_PERIPHID0" offset="0xFE0" width="32" description=" Part of the set of Peripheral Identification registers. Contains part of the designer specific part number.">
		<bitfield id="PART_0" width="8" begin="7" end="0" resetval="0x6" description=" Bits [7 : 0] of the component's part number. This is selected by the designer of the component." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_PERIPHID1" acronym="CTI__CFG__CSCTI_CFG_PERIPHID1" offset="0xFE4" width="32" description=" Part of the set of Peripheral Identification registers. Contains part of the designer specific part number and part of the designer identity.">
		<bitfield id="DES_0" width="4" begin="7" end="4" resetval="0x0" description=" Bits 3 : 0 of the JEDEC identity code indicating the designer of the component (along with the continuation code)" range="7 - 4" rwaccess="R"/> 
		<bitfield id="PART_1" width="4" begin="3" end="0" resetval="0x9" description=" Bits [11 : 8] of the component's part number. This is selected by the designer of the component." range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_PERIPHID2" acronym="CTI__CFG__CSCTI_CFG_PERIPHID2" offset="0xFE8" width="32" description=" Part of the set of Peripheral Identification registers. Contains part of the designer identity and the product revision.">
		<bitfield id="REVISION" width="4" begin="7" end="4" resetval="0x4" description=" The Revision field is an incremental value starting at 0x0 for the first design of this component. This only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the exact major/minor revision." range="7 - 4" rwaccess="R"/> 
		<bitfield id="JEDEC" width="1" begin="3" end="3" resetval="0x1" description=" Always set. Indicates that a JEDEC assigned value is used" range="3" rwaccess="R"/> 
		<bitfield id="DES_1" width="3" begin="2" end="0" resetval="0x0" description=" Bits 6 : 4 of the JEDEC identity code indicating the designer of the component (along with the continuation code)" range="2 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_PERIPHID3" acronym="CTI__CFG__CSCTI_CFG_PERIPHID3" offset="0xFEC" width="32" description=" Part of the set of Peripheral Identification registers. Contains the RevAnd and Customer Modified fields.">
		<bitfield id="REVAND" width="4" begin="7" end="4" resetval="0x0" description=" This field indicates minor errata fixes specific to this design, for example metal fixes after implementation. In most cases this field is zero. It is recommended that component designers ensure this field can be changed by a metal fix if required, for example by driving it from registers that reset to zero." range="7 - 4" rwaccess="R"/> 
		<bitfield id="CMOD" width="4" begin="3" end="0" resetval="0x0" description=" Where the component is reusable IP, this value indicates if the customer has modified the behavior of the component. In most cases this field is zero." range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_COMPID0" acronym="CTI__CFG__CSCTI_CFG_COMPID0" offset="0xFF0" width="32" description=" Reserved Reserved Reserved A component identification register, that indicates that the identification registers are present.">
		<bitfield id="PRMBL_0" width="8" begin="7" end="0" resetval="0x13" description=" Contains bits [7 : 0] of the component identification" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_COMPID1" acronym="CTI__CFG__CSCTI_CFG_COMPID1" offset="0xFF4" width="32" description=" A component identification register, that indicates that the identification registers are present. This register also indicates the component class.">
		<bitfield id="CLASS" width="4" begin="7" end="4" resetval="0x9" description=" Class of the component. E.g. ROM table, CoreSight component etc. Constitutes bits [15 : 12] of the component identification." range="7 - 4" rwaccess="R"/> 
		<bitfield id="PRMBL_1" width="4" begin="3" end="0" resetval="0x0" description=" Contains bits [11 : 8] of the component identification" range="3 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_COMPID2" acronym="CTI__CFG__CSCTI_CFG_COMPID2" offset="0xFF8" width="32" description=" A component identification register, that indicates that the identification registers are present.">
		<bitfield id="PRMBL_2" width="8" begin="7" end="0" resetval="0x5" description=" Contains bits [23 : 16] of the component identification" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CTI__CFG__CSCTI_CFG_COMPID3" acronym="CTI__CFG__CSCTI_CFG_COMPID3" offset="0xFFC" width="32" description=" A component identification register, that indicates that the identification registers are present.">
		<bitfield id="PRMBL_3" width="8" begin="7" end="0" resetval="0x0" description=" Contains bits [31 : 24] of the component identification" range="7 - 0" rwaccess="R"/>
	</register>
</module>